<h1 style="background-color:orange;padding:10px 0 10px 8px;display:inline;">Data Frames</h1>

In [1]:
import pandas as pd

<h1 style="background-color:orange;padding:10px 0 10px 8px;display:inline;">Ways of creating Data Frames</h1>

### 1) Using Dictionary
### 2) Using list of tuples
### 3) By loading dataset files

In [47]:
dataset = {
    "Year" : [1989,1990,1991,1992,1993,1994,1995,1996,1997],
    "Month" : [2,4,1,5,3,7,8,3,4],
    "Status" : ["Grow","Not grow","Grow","Grow","Grow","Not grow","Not grow","Grow","Grow"],
    "Number of students" : [2300,1200,4000,5000,1100,1000,3400,2300,8700]
}
data_frame_1 = pd.DataFrame(dataset)
data_frame_1

   Year  Month    Status  Number of students
0  1989      2      Grow                2300
1  1990      4  Not grow                1200
2  1991      1      Grow                4000
3  1992      5      Grow                5000
4  1993      3      Grow                1100
5  1994      7  Not grow                1000
6  1995      8  Not grow                3400
7  1996      3      Grow                2300
8  1997      4      Grow                8700

In [48]:
list_of_tuple = [
    (1,"Abdullah",12,"A+ grade"),
    (2,"Bilal",11,"B grade"),
    (3,"Faraz",10,"A grade"),
    (4,"Hassan",12,"A+ grade"),
    (5,"Ali",12,"B+ grade"),
]

data_frame_2 = pd.DataFrame(list_of_tuple , columns=["Roll#","Name","Class","Grade"])
data_frame_2

   Roll#      Name  Class     Grade
0      1  Abdullah     12  A+ grade
1      2     Bilal     11   B grade
2      3     Faraz     10   A grade
3      4    Hassan     12  A+ grade
4      5       Ali     12  B+ grade

### If the dataset will be more than 60 rows or records, then dataframe will show first and last 5 rows

In [51]:
data_frame_3 = pd.read_csv('data.csv')
data_frame_3

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

<h1 style="background-color:orange;padding:10px 0 10px 8px;display:inline;">Different Operations on DataFrames</h1>

In [52]:
data_frame_3.shape

(169, 4)

In [53]:
data_frame_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [55]:
data_frame_3.describe()

         Duration       Pulse    Maxpulse     Calories
count  169.000000  169.000000  169.000000   164.000000
mean    63.846154  107.461538  134.047337   375.790244
std     42.299949   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

In [56]:
data_frame_3.head(1)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1

In [57]:
data_frame_3.tail(1)

     Duration  Pulse  Maxpulse  Calories
168        75    125       150     330.4

In [59]:
data_frame_3.Duration.max() #or data_frame_3['Duration'].max()

300

In [60]:
data_frame_3.Duration.min()

15

In [79]:
data_frame_3['Duration'].mean()

63.84615384615385

In [80]:
data_frame_3.median()

Duration     60.0
Pulse       105.0
Maxpulse    131.0
Calories    318.6
dtype: float64

### Columns Slicing

In [61]:
data_frame_3[["Duration","Pulse"]]

     Duration  Pulse
0          60    110
1          60    117
2          60    103
3          45    109
4          45    117
..        ...    ...
164        60    105
165        60    110
166        60    115
167        75    120
168        75    125

[169 rows x 2 columns]

### Rows slicing

In [62]:
data_frame_3[3:7]

   Duration  Pulse  Maxpulse  Calories
3        45    109       175     282.4
4        45    117       148     406.0
5        60    102       127     300.0
6        60    110       136     374.0

In [63]:
data_frame_3.columns

Index(['Duration', 'Pulse', 'Maxpulse', 'Calories'], dtype='object')

## Search from dataframe just like of quries

In [67]:
df = data_frame_3
df[df.Pulse>=151]

    Duration  Pulse  Maxpulse  Calories
58        20    153       172     226.4
80        30    159       182     319.2
85        30    151       170     300.0
95        20    151       168     229.4
97        25    152       168     244.2

In [70]:
df[["Calories","Maxpulse"]][df.Pulse>151]

    Calories  Maxpulse
58     226.4       172
80     319.2       182
97     244.2       168

In [85]:
df[["Pulse","Duration"]][df.Duration==df.Duration.max()]

    Pulse  Duration
69    108       300

## And( & ) Or( | ) in search quries

In [88]:
filtered_df = df[(df['Duration'] > 200) & (df['Pulse'] <200)]
filtered_df

     Duration  Pulse  Maxpulse  Calories
60        210    108       160    1376.0
69        300    108       143    1500.2
79        270    100       131    1729.0
109       210    137       184    1860.4

In [94]:
filtered_df = df[(df.Maxpulse>=170) | (df.Calories<2)]
filtered_df

     Duration  Pulse  Maxpulse  Calories
3          45    109       175     282.4
54         30    136       175     238.0
58         20    153       172     226.4
80         30    159       182     319.2
85         30    151       170     300.0
94         20    150       171     127.4
109       210    137       184    1860.4
144        60    136       170     470.2

In [97]:
df[df.Calories>1200]

     Duration  Pulse  Maxpulse  Calories
60        210    108       160    1376.0
69        300    108       143    1500.2
79        270    100       131    1729.0
109       210    137       184    1860.4

## Loc will return Series of single row or record

In [74]:
df.set_index("Duration").head(4)

          Pulse  Maxpulse  Calories
Duration
60          110       130     409.1
60          117       145     479.0
60          103       135     340.0
45          109       175     282.4

In [81]:
df.loc[45]

Duration     60.0
Pulse        99.0
Maxpulse    119.0
Calories    273.0
Name: 45, dtype: float64